{
    "idiomas": {
        "en": "Inglés",
        "es": "Español"
    },
    "menu":{
        "inicio":"Inicio",
        "habilidades":"Habilidades",
        "trabajo":"Trabajo",
        "proyectos":"Proyectos",
        "educacion":"Educación"
    },
    "titulos": {
        "portafolio": "PORTAFOLIO",
        "habilidades": "HABILIDADES",
        "tecnologia": "Habilidades",
        "trabajo": "TRABAJO",
        "proyectos": "PROYECTOS",
        "otros": "OTROS PROYECTOS",
        "educacion": "EDUCACIÓN"
    },
    "presentacion": {
        "saludo": "¡Hola Mundo!",
        "soy": "Soy ",
        "desarrollador": " un Desarrollador Web",
        "puesto1": "Desarrollador Frontend",
        "puesto2": "Desarrollador Backend",
        "puesto3": "Desarrollador FullStack",
        "discurso": "Mi nombre es Anthony González Solano, tengo una carrera en informática empresarial en la que me he desarrollado no solo como desarrollador web, sino también adquiriendo habilidades para la gestión de proyectos y finanzas. Soy el tipo de desarrollador que puede cambiar fácilmente de tecnología y aprender por sí mismo lo necesario con respecto a seguridad y buenas prácticas. Por lo tanto, he utilizado una variedad de tecnologías."
    },
    "habilidades": {
        "lenguajes": "Lenguajes de programación",
        "bd": "Bases de datos",
        "nube":"En la nuve",
        "otros":"Others"
    },
    "trabajos": {
        "texto1": "Tecnologías usadas:",
        "texto2": "Acerca del trabajo:",
        "1": {
            "puesto": "Desarrollador Frontend",
            "institucion": "Universidad de Costa Rica - Costa Rica",
            "descripcion": "En mi rol como Desarrollador Frontend, he destacado por mi dedicación al mantenimiento y actualización de un sitio web enfocado en la exhibición de proyectos y recopilación de datos históricos. Mediante la utilización de tecnologías como React, HTML y CSS, contribuí significativamente a la mejora tanto de la funcionalidad como del diseño del sitio.<br /><br />Además, implementé rigurosos procedimientos y controles de seguridad con el propósito de resguardar el sitio web de posibles amenazas, asegurando la integridad de los datos alojados. Mi experiencia incluyó la colaboración efectiva con equipos multidisciplinarios, facilitando la recopilación e incorporación de cambios de contenido para proporcionar a los visitantes información oportuna y relevante.<br /><br />Asimismo, mantuve una evaluación continua del rendimiento del sitio, llevando a cabo ajustes fundamentados en lecciones aprendidas. A través del seguimiento meticuloso del tráfico del sitio web, el comportamiento de los usuarios y las métricas de participación mediante herramientas de análisis, implementé mejoras proactivas para garantizar una experiencia óptima para los usuarios.",
            "mes": "Octubre"
        },
        "2": {
            "puesto": "Desarrollador de Software Full Stack",
            "institucion": "Universidad de Costa Rica - Costa Rica",
            "descripcion": "En mi papel como Desarrollador de Software Full Stack en la Universidad de Costa Rica, desempeñé un papel integral al contribuir tanto al desarrollo backend con Django como al desarrollo frontend con React Redux.<br /><br />Mi labor consistió en proporcionar soluciones y opciones para la implementación, con el objetivo de mejorar la eficiencia y funcionalidad del software. Además, facilité la comunicación entre los equipos de desarrollo, asegurando una colaboración efectiva para alcanzar los objetivos del proyecto de manera eficiente.<br /><br />Participé activamente en revisiones de código, abordé problemas técnicos de manera proactiva y me aseguré de que el software cumpliera con estándares de alta calidad. Mi enfoque se centró en mantener la integridad técnica del proyecto, contribuyendo a la optimización continua y al cumplimiento de los requisitos establecidos.",
            "mes": "Julio"
        }
    },
    "proyectos": {
        "boton1":"Ver Código",
        "boton2":"Ver Página Web",
        "1": {
            "titulo": "Portafolio",
            "descripcion": "Este proyecto de software, denominado 'Portafolio,' se presenta como una representación digital exhaustiva de mi carrera y habilidades como Desarrollador Web. Diseñado para proporcionar una visión completa de mi experiencia y proyectos relevantes, el portafolio se destaca como una plataforma interactiva y visualmente atractiva.<br /><br />En la sección inicial, se da la bienvenida al visitante, seguido de una breve descripción personal que resalta mi enfoque en el desarrollo web, abarcando tanto el Frontend como el Backend.<br /><br />El portafolio se estructura en diversas secciones, entre las que se incluyen una detallada categorización de mis habilidades en diversos lenguajes de programación. Esta segmentación proporciona una visión clara de las competencias técnicas que he desarrollado a lo largo de mi carrera.<br /><br />La sección de experiencia laboral profundiza en roles anteriores, destacando logros significativos. En cuanto a proyectos, el 'Portfolio' mismo se destaca como el proyecto actual. Desarrollado utilizando React para el frontend, este portafolio proporciona una interfaz interactiva y fácil de navegar, permitiendo a los visitantes explorar de manera efectiva mi experiencia y habilidades.<br /><br />Finalmente, el proyecto incluye una sección educativa que detalla mi formación académica, como mi Bachillerato en Informática Empresarial de la Universidad de Costa Rica.",
            "descripcionCorta":"El 'Portafolio', se presenta como una representación envolvente de habilidades y logros. Diseñado para destacar de manera interactiva mi experiencia y proyectos clave, este portafolio busca proporcionar una visión integral y visualmente atractiva de mi trayectoria en el desarrollo web."
        },
        "2": {
            "titulo": "Chatbot con aprendizaje",
            "descripcion": "Este proyecto es un chatbot con capacidad de aprendizaje diseñado para interactuar de manera eficiente y personalizada. Utiliza una base de datos en SQL para almacenar preguntas y respuestas, una API desarrollada en Express.js para gestionar las solicitudes y un frontend implementado en Angular para la interfaz de usuario. <br /><br />El chatbot tiene la capacidad de responder a una variedad de preguntas predefinidas, las cuales están almacenadas en la base de datos. Al inicio de la conversación, presenta las preguntas a las que puede responder. Si se le hace una pregunta que no conoce, informa al usuario que no puede proporcionar una respuesta. Por otro lado, si conoce la pregunta, devuelve la respuesta asociada. <br /><br />Una característica clave es la capacidad del usuario para calificar la calidad de la respuesta. Si el usuario considera que la respuesta es insatisfactoria, puede indicar 'no me gusta esa respuesta'. El chatbot se disculpa y solicita al usuario proporcionar una respuesta mejor. Una vez proporcionada, actualiza la base de datos para ofrecer respuestas mejoradas en el futuro. <br /><br />Además, el chatbot permite a los usuarios enseñarle nuevas preguntas. Al indicar 'quiero enseñarte una pregunta', el chatbot solicita la nueva pregunta y su respuesta. Después de recibir la información, guarda la pregunta y se vuelve capaz de responderla en futuras interacciones. <br /><br />Si el usuario desea conocer las preguntas a las que el chatbot puede responder, puede preguntar 'cuales preguntas puedes responder', y el chatbot proporcionará una lista detallada de las preguntas que conoce.",
            "descripcionCorta":"Chatbot con aprendizaje y base de datos SQL. Responde preguntas predefinidas, aprende de retroalimentación del usuario y permite enseñarle nuevas preguntas. Desarrollado con Express.js y Angular."
        },
        "3": {
            "titulo": "Tik Tak Toe",
            "descripcion": "Este proyecto es un juego de tic-tac-toe con una función de línea de tiempo.<br /><br />Este juego clásico de tres en línea permite a dos jugadores enfrentarse en una partida normal con círculos y equis. La característica distintiva es la capacidad de retroceder en el tiempo a cualquier movimiento anterior, incluso al inicio de la partida.<br /><br />Al regresar a un punto específico, lo movimientos previos se deshacen, permitiendo a los jugadores crear un nuevo historial de movimientos a partir del último movimiento realizado.<br /><br />La aplicación realiza un seguimiento de los resultados, identificando al ganador o en su defecto expresando que nadie gano.",
            "descripcionCorta":"Clásico juego de tic-tac-toe con función de línea de tiempo. Dos jugadores compiten en una partida normal con círculos y equis. La línea de tiempo permite retroceder a cualquier movimiento anterior, creando un nuevo historial a partir del último movimiento."
        }
    },
    "educacion": {
        "texto":"Este certificado está a sólo unos días",
        "1": {
            "grado": "Bachillerato en Informática Empresarial",
            "institucion": "Universidad de Costa Rica"
        },
        "2": {
            "grado": "Certificado de Scrum Fundamentals",
            "institucion": "SCRUM Study"
        },
        "3": {
            "grado": "Certificado de Docker Essentials",
            "institucion": "Cognitive Class"
        }
    }
}